In [3]:
import pandas as pd

df = {"Name": ['John', 'Jake'], "Treatment A": [10, 12], "Treatment B": [20, 21]}

df = pd.DataFrame.from_dict(df)

df

   Name  Treatment A  Treatment B
0  John           10           20
1  Jake           12           21

We reshape the dataset so that the variable treatment (of value A, B) is in a single column

In [5]:
pd.melt(frame = df, id_vars = 'Name', var_name = 'Treatment', value_name = 'Result')

   Name    Treatment  Result
0  John  Treatment A      10
1  Jake  Treatment A      12
2  John  Treatment B      20
3  Jake  Treatment B      21

In [25]:
df = {"Name": ['John', 'Jake', 'Anna', 'Spongebob'], "Class": ['Economy', 'First', 'First', 'Business']}

df = pd.DataFrame.from_dict(df)

df

        Name     Class
0       John   Economy
1       Jake     First
2       Anna     First
3  Spongebob  Business

In [26]:
df = pd.get_dummies(df, columns = ['Class'])

df

        Name  Class_Business  Class_Economy  Class_First
0       John               0              1            0
1       Jake               0              0            1
2       Anna               0              0            1
3  Spongebob               1              0            0